Revit 2020 API
Room Properties
The Room type exposes the following members.
Properties
Name | Description
Area
The area.
 (Inherited from SpatialElement.)
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BaseOffset
Get or Set the Base Offset of the Room.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
ClosedShell
Return the closedShell of the Room.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
Level
Gets the level of the room.
 (Inherited from SpatialElement.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
LimitOffset
Get or Set the Limit Offset of the Room.
Location
The location of the element.
 (Inherited from SpatialElement.)
Name
A human readable name for the Element.
 (Inherited from SpatialElement.)
Number
The number.
 (Inherited from SpatialElement.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Perimeter
The perimeter.
 (Inherited from SpatialElement.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
UnboundedHeight
Get the Unbounded Height of the Room.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UpperLimit
Get or Set the Upper Limit of the Room.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Volume
Get the Volume of the Room.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace